import os
import numpy
import seaborn
from matplotlib.pyplot import figure
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
import requests
import json

#--------------------------------------------------------------------------------------------------
#INFORMANDO A URL
url = 'http://awaire-air-quality/api/v1/aermod_outputs'
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#INFORMANDO O LOCAL DOS ARQUIVOS
caminho = '/home/sodarec/data_sender/pst_data/'
destiino = '/home/sodarec/data_sender/pst_data/inseridos/'
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#INFORMANDO O NOME DAS ENTRADAS NO DIRETÓRIO caminho
entradas = os.listdir(caminho)
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#INFORMANDO O ARRAY AUXILIAR
dados = []
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#TEMPO DE PREVISÃO - ALTERAR PARA PLOTAR OUTRO HORIZONTE DE TEMPO
# prev = sys.argv[1]  #PEGENDO O TEMPO DE PREVISAO INFORMADAO PELA LINHA DE COMANDO.
prev = 12
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#INFORMANDO AO USUÁRIO O HORIZONTE TEMPORAL DA PREVISÃO
print('Previsão para ' + str(prev) + ' hora(s)')
#--------------------------------------------------------------------------------------------------



#--------------------------------------------------------------------------------------------------
#ACESSANDO OS ARQUIVOS DO DIRETÓRIO caminho
for entrada in entradas:
#--------------------------------------------------------------------------------------------------



	#--------------------------------------------------------------------------------------------------
	#ACESSANDO OS ARQUIVOS .PST DO DIRETÓRIO caminho
	if entrada.endswith(".PST"):
	#--------------------------------------------------------------------------------------------------



		#--------------------------------------------------------------------------------------------------
		#LENDO ARQUIVOS .PST
		arquivo = open(caminho + entrada).readlines()
		#INÍCIO DA LEITURA DO ARQUIVO
		for i in range(len(arquivo)):



			#--------------------------------------------------------------------------------------------------
			#PULANDO O CABEÇALHO DO ARQUIVO
			linha = arquivo[i].split()
			if ('*' in arquivo[i][0]):
				continue
			#--------------------------------------------------------------------------------------------------



			#--------------------------------------------------------------------------------------------------
			#CONDIÇÃO PARA PEAGAR DADOS
			if int(linha[8][6:]) == int(prev):
			
				
				#FAZENDO UM POST POR VEZ - EX: {'x': -7000, 'y': -7000, 'concentration': '0.00775', 'date_predicted': '20012612'} linha[8]

				#--------------------------------------------------------------------------------------------------
				dic = {'x':round(float(linha[0])), 'y': round(float(linha[1])), 'concentration':linha[2], 'date_predicted':'2020-01-26 12:00:00', 'aermod_input_id':1}
				# x = requests.post(url, data = dic)
				# print(x.text)
				dados.append(dic)
				#--------------------------------------------------------------------------------------------------
				continue
			#--------------------------------------------------------------------------------------------------
		#--------------------------------------------------------------------------------------------------
	#--------------------------------------------------------------------------------------------------
#--------------------------------------------------------------------------------------------------

#FAZENDO UM POST COM TODOS OS DADOS - EX: [{'x': -7000, 'y': -7000, 'concentration': '0.00775', 'date_predicted': '20012612'}, {'x': -6500, 'y': -7000, 'concentration': '0.00754', 'date_predicted': '20012612'}, ...]




headers = {'content-type': 'application/json'}
x = requests.post(url, data = json.dumps(dados), headers=headers)
print(x.text)
